abusaidm.html-snippets
akamud.vscode-caniuse
anseki.vscode-color
azemoh.one-monokai
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
cmstead.jsrefactor
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
eg2.vscode-npm-script
esbenp.prettier-vscode
humao.rest-client
ms-vscode.vscode-typescript-tslint-plugin
msjsdiag.debugger-for-chrome
naumovs.color-highlight
oderwat.indent-rainbow
Orta.vscode-jest
vscodevim.vim
waderyan.gitblame
xabikos.JavaScriptSnippets
xabikos.ReactSnippets
Zignd.html-css-class-completion
